Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This differs from the ListView by allowing two levels: groups which can individually be expanded to show its children.
zh_cn: 这与 ListView 的不同之处在于允许两个级别：可以单独展开以显示其子级别的组。

source: This directive assigns the alias custom to the namespace http://schemas.android.com/apk/res/com.example.customviews.
zh_cn: 此伪指令将别名 custom 分配给命名空间 http://schemas.android.com/apk/res/com.example.customviews。

source: This directory contains a subdirectory for each platform type, like armeabi, armeabi-v7a, arm64-v8a, x86, x86_64, and mips.
zh_cn: 这个目录包含每个平台类型的子目录，如 armeabi、armeabi-v7a、arm64-v8a、x86、x86_64、mips。

source: This distinction is controlled by inInputShareable.
zh_cn: 这个区别由 inInputShareable 控制。

source: This document provides information to help you optimize your app’s launch time.
zh_cn: 本文档提供的信息可帮助你优化应用的发布时间。

source: This does not need to be a View, but can be some other container of the page.
zh_cn: 这不需要是一个 View，但可以是页面的其他容器。

source: This drawable should generally take the place of title text.
zh_cn: 该 drawable 通常应取代标题文本。

source: This ensures interoperability with nested scrolling views on Android 5.0 Lollipop and newer.
zh_cn: 这确保了与 Android 5.0 Lollipop 和更新版本上的嵌套滚动 view 的互操作性。

source: This event does not specify what about the data set has changed, forcing any observers to assume that all existing items and structure may no longer be valid.
zh_cn: 此事件不指定数据集发生了什么变化，迫使任何观察者假定所有现有项和结构可能不再有效。

source: This example overrides only one method, onDraw(), but you might need to override others as you create your own custom components.
zh_cn: 此示例仅覆盖一个方法 onDraw()，但你可能需要在创建自己的自定义组件时覆盖其他方法。

source: This exception is thrown by the resource APIs when a requested resource can not be found.
zh_cn: 无法找到请求的资源时，资源 API 会抛出此异常。

source: This exception may be thrown by methods that have detected concurrent modification of an object when such modification is not permissible.
zh_cn: （译注：参考：http://www.oschina.net/uploads/doc/javase-6-doc-api-zh_CN/index.html?java/util/ConcurrentModificationException.html） 当方法检测到对象的并发修改，但不允许这种修改时，抛出此异常。

source: This field was deprecated in API level 21.
zh_cn: 此字段在 API 级别 21 中已被弃用。

source: This field was deprecated in API level 24.
zh_cn: 此字段在 API 级别 24 中已被弃用。

source: This file contains the XML content from all configurations of the res/values/ folder.
zh_cn: 此文件包含 res/values/ 文件夹的所有配置的 XML 内容。

source: This file lists the name, version, access rights, and referenced library files of the app.
zh_cn: 此文件列出了应用程序的名称，版本，访问权限和引用的库文件。

source: This flag can be controlled in your theme through the R.attr.windowTranslucentStatus attribute; this attribute is automatically set for you in the standard translucent decor themes such as R.style.Theme_Holo_NoActionBar_TranslucentDecor, R.style.Theme_Holo_Light_NoActionBar_TranslucentDecor, R.style.Theme_DeviceDefault_NoActionBar_TranslucentDecor, and R.style.Theme_DeviceDefault_Light_NoActionBar_TranslucentDecor.
zh_cn: 可以通过 R.attr.windowTranslucentStatus 属性在主题中控制此标志;此属性将在标准半透明装饰主题中自动设置，例如 R.style.Theme_Holo_NoActionBar_TranslucentDecor，R.style.Theme_Holo_Light_NoActionBar_TranslucentDecor，R.style.Theme_DeviceDefault_NoActionBar_TranslucentDecor 和 R.style.Theme_DeviceDefault_Light_NoActionBar_TranslucentDecor。

source: This flag can not be used when the caller is requesting a result from the activity being launched.
zh_cn: 当调用方从正在启动的 activity 请求结果时，不能使用此标志。

source: This flag is generally used by activities that want to present a "launcher" style behavior: they give the user a list of separate things that can be done, which otherwise run completely independently of the activity launching them.
zh_cn: 此标志通常由希望呈现“启动程序”样式行为的 activity 使用：它们为用户提供一个可以执行的单独操作的列表，否则这些操作将完全独立于启动它们的 activity 运行。

source: This flag is not normally set by application code, but set for you by the system as described in the launchMode documentation for the singleTask mode.
zh_cn: 此标志通常不是由应用程序代码设置的，而是由系统为你设置的，如 singleTask 模式的 launchMode 文档中所述。

source: This flag is not normally set by application code, but set for you by the system if this activity is being launched from history (longpress home key).
zh_cn: 此标志通常不由应用程序代码设置，但如果此 activity 是从历史记录启动的(长按 Home 键)，则由系统为你设置。

source: This flag is only used in split-screen multi-window mode.
zh_cn: 该标志仅在分屏多窗口模式下使用。

source: This flag is used to create a new task and launch an activity into it.
zh_cn: 此标志用于创建新 task 并向其中启动 activity。

source: This flag is used to open a document into a new task rooted at the activity launched by this Intent.
zh_cn: 此标志用于将文档打开到此 intent 启动的 activity 的新 task 中根。

source: This flag needs to be set for any of the other flags to take effect.
zh_cn: 需要设置此标志才能使任何其他标志生效。

source: This flag should not be combined with any of the other scroll flags.
zh_cn: 此标志不应与任何其他滚动标志组合使用。

source: This flag will cause appropriate navigation modes to use a wider logo in place of the standard icon.
zh_cn: 此标志将使适当的导航模式使用更宽的徽标代替标准图标。

source: This functionality and UI is better handled with custom views and layouts rather than a dedicated zoom-control widget
zh_cn: 使用自定义 view 和布局而不是专用缩放控件窗口小部件可以更好地处理此功能和 UI

source: This garbage collection will need to be performed at any time the array needs to be grown or the the map size or entry values are retrieved.
zh_cn: 这个垃圾收集需要在数组需要增长或获取映射大小或获取条目值时执行。

source: This gesture makes sense if the UI responds by moving quickly in the direction of the fling, then slowing down, as if the user had pushed on a flywheel and set it spinning.
zh_cn: 如果 UI 通过快速朝向投掷方向移动来响应，然后减速，则该手势是有意义的，就好像用户已经按下飞轮并将其旋转一样。

source: This grants temporary access permission for the content URI to the specified package, according to the value of the the mode_flags parameter, which you can set to FLAG_GRANT_READ_URI_PERMISSION, FLAG_GRANT_WRITE_URI_PERMISSION or both.
zh_cn: 这将根据 mode_flags 参数的值将 content URI 的临时访问权限授予指定的包，你可以将其设置为 FLAG_GRANT_READ_URI_PERMISSION ， FLAG_GRANT_WRITE_URI_PERMISSION 或两者同时。

source: This guarantees that at the end of the measure pass, all parents accept all of their children's measurements.
zh_cn: 这才能保证在 measure 过程结束时，所有的父 view 都接受它们子 view 的测量结果。

source: This has the same effect as calling setTargetSize(int, int) with dimensions based on the sampleSize.
zh_cn: 这与使用基于 sampleSize 的维度调用 setTargetSize(int, int) 的效果相同。

source: This has the same visual effect as WindowManager.LayoutParams.FLAG_FULLSCREEN, meaning that non-critical screen decorations (such as the status bar) will be hidden while the user is in the View's window, focusing the experience on that content.
zh_cn: 这与 WindowManager.LayoutParams.FLAG_FULLSCREEN 具有相同的视觉效果，这意味着当用户进入 View 的窗口时，将隐藏非关键屏幕装饰(例如状态栏)，重点关注该内容的体验。

source: This helper returns an appropriate View.MeasureSpec value by comparing the view's desired size to the spec passed into onMeasure().
zh_cn: 此助手通过将 view 的所需大小与传递到 onMeasure() 的 spec 进行比较，返回适当的 View.MeasureSpec 值。

source: This hint defaults to true and is persistent across fragment instance state save and restore.
zh_cn: 该提示默认是 true，它将在 fragment 的保存和恢复过程中保持。

source: This implementation composes a string by iterating over its mappings.
zh_cn: 此实现通过迭代其映射来组合字符串。

source: This implementation is separate from ArrayMap, however, so the Object array contains only one item for each entry in the set (instead of a pair for a mapping).
zh_cn: 但是，这个实现与 ArrayMap 是分开的，因此对象数组对于集合中的每个项只包含一个项(而不是一对映射项)。

source: This includes all logging up to the DEBUG level.
zh_cn: 这包括一直到 DEBUG 级别的所有日志记录。

source: This includes changing the focus as views are removed or hidden, or as new views become available.
zh_cn: 这包括在移除或隐藏 view 时或在新 view 可用时更改焦点。

source: This includes keeping track of the X and Y scroll offset as well as mechanisms for drawing scrollbars.
zh_cn: 这些支持包括保持跟踪 X、Y 的滚动偏移量及绘制滚动条的支持。

source: This includes logo and icon.
zh_cn: 这包括徽标和图标。

source: This includes users with disabilities that prevent them from seeing or using a touchscreen.
zh_cn: 这包括看到或使用触摸屏有困难的残障用户。

source: This interface contains query methods used to determine the results of a match against a regular expression.
zh_cn: 此接口包含用于确定与正则表达式匹配结果的查询方法。

source: This interface is now obsolete.
zh_cn: 此接口现已过时。

source: This interface is used to make sure that the text entered in this TextView complies to a certain format.
zh_cn: 此接口用于确保在此 TextView 中输入的文本符合特定格式。

source: This interface should be implemented by View subclasses that wish to support dispatching nested scrolling operations to a cooperating parent ViewGroup.
zh_cn: 如果 View 子类希望支持将嵌套滚动操作分派给协作父 ViewGroup ，则应实现此接口。

source: This interface should be implemented by ViewGroup subclasses that wish to support scrolling operations delegated by a nested child view.
zh_cn: 此接口应由 ViewGroup 子类实现，这些子类希望支持由嵌套子 view 委派的滚动操作。

source: This is a cleaner way to create inner classes if they do not need access to state from the outer class, keeps the generated class small, and allows it to be used easily from other classes.
zh_cn: 如果他们不需要从外部类访问状态，这是一个更简洁的方法来创建内部类，它可以让生成的类更小，而且方便从其他类访问。

source: This is a marker annotation and it has no specific attributes.
zh_cn: 这是一个标记注解，它没有特定的属性。

source: This is a structural change event.
zh_cn: 这是一个结构性变更事件。

source: This is a tap, so remove the longpress check
zh_cn: 这是一个 tap，所以移除长按检查

source: This is a utility class to add swipe to dismiss and drag & drop support to RecyclerView.
zh_cn: 这是一个实用的类，可用来给 RecyclerView 添加滑动关闭和拖拽的支持。

source: This is an even less obtrusive state than that called for by SYSTEM_UI_FLAG_LOW_PROFILE; on devices that draw essential navigation controls (Home, Back, and the like) on screen, SYSTEM_UI_FLAG_HIDE_NAVIGATION will cause those to disappear.
zh_cn: 这是一个比 SYSTEM_UI_FLAG_LOW_PROFILE 所要求的更不突兀的状态；在屏幕上绘制基本导航控件(Home，Back 等)的设备上，SYSTEM_UI_FLAG_HIDE_NAVIGATION 将导致这些控件消失。

source: This is an implementation detail of ImageDecoder, and should never be called manually.
zh_cn: 这是 ImageDecoder 的实现细节，绝不应手动调用。

source: This is an important aspect of developing Android applications that are compatible on different types of devices.
zh_cn: 这是开发兼容不同类型设备的 Android 应用程序的一个重要方面。

source: This is an item change event, not a structural change event.
zh_cn: 这是项更改事件，而不是结构更改事件。

source: This is called when the view is attached to a window.
zh_cn: 当 view 附加到窗口时调用。

source: This is called when the view is detached from a window.
zh_cn: 当 view 从窗口移队时调用。

source: This is called within a tight loop, so you are not allowed to allocate objects, including the return array.
zh_cn: 这是在紧密循环中调用的，因此不允许分配对象，包括返回数组。

source: This is commonly referred to as the 'quick return' pattern.
zh_cn: 这通常被称为“快速返回”模式。

source: This is considered acceptable as well, although the name is nonstandard.
zh_cn: 虽然名称并不规范，但也可接受。

source: This is dangerous, so do it only if you are positive that if this error occurs the appropriate thing to do is crash.
zh_cn: 这样做比较危险，因此请仅在下述情况下采用这种方案：你确定，如果发生此错误，最适当的处理方式就是让应用崩溃。

source: This is deprecated.
zh_cn: 这已被弃用。

source: This is especially important in the interaction between the framework and applications, and conditions caused by third-party applications that are properly handled by the framework should not trigger logging higher than the DEBUG level.
zh_cn: 这在框架和应用之间的交互中尤为重要，而且由第三方应用造成的情况经过框架妥善处理后，不应该触发高于 DEBUG 级别的日志记录。

source: This is especially important when writing framework code as it's not easy to know in advance what will and will not be private information or protected content.
zh_cn: 这在编写框架代码时尤为重要，因为事先无法轻易得知哪些是个人信息或受保护的内容，哪些不是。

source: This is especially useful, for example, when launching an activity from the notification manager.
zh_cn: 这是特别有用，例如，从通知管理器启动 activity 时。

source: This is ignored for animated drawables.
zh_cn: animated drawables 会忽略这一点。

source: This is incompatible with ALLOCATOR_HARDWARE.
zh_cn: 这与 ALLOCATOR_HARDWARE 不兼容。

source: This is incompatible with decodeDrawable; attempting to decode an unpremultiplied Drawable will throw an IllegalStateException.
zh_cn: 这与 decodeDrawable 不兼容;尝试解码未经过乘法的 Drawable 将抛出 IllegalStateException。

source: This is intended to be used with ActionBar#setCustomView(View) to place the bread crumbs in the action bar.
zh_cn: 这与 ActionBar#setCustomView(View) 一起使用，将面包屑放在操作栏中。

source: This is made slightly more complex by the requirements of limits from the parent (which are passed in to the onMeasure() method) and by the requirement to call the setMeasuredDimension() method with the measured width and height once they have been calculated.
zh_cn: 由于 2 个限制使得该方法稍微有点复杂，一是来自父类的限制（通过 onMeasure() 方法传递），2 是当测量出宽高后需要调用 setMeasuredDimension() 方法。

source: This is not a perfect example, and the APIs for doing this might change from this early preview, but it does demonstrate the principles.
zh_cn: 这不是一个完美的例子，相对于早期版本来说，很多 API 可能已经改变了，但它仍然演示了一些原则。

source: This is not a perfect example, and the APIs for doing this might change, but it does demonstrate the principles.
zh_cn: 这不是一个完美的例子，用于这样做的 API 可能会更改，但它确实证明了这些原则。

source: This is not guaranteed to cancel the decode, but if it does, the decoder... operation will return null, or if inJustDecodeBounds is true, will set outWidth/outHeight to -1
zh_cn: 这不能保证取消解码，但如果解码完成，则解码器...操作将返回空值，或者如果 inJustDecodeBounds 为 true，则会将 Width / outHeight 设置为-1

source: This is required in order to change any of the default settings.
zh_cn: 这是更改任何默认设置所必需的。

source: This is similar in purpose to the older @TargetApi annotation, but more clearly expresses that this is a requirement on the caller, rather than being used to "suppress" warnings within the method that exceed the minSdkVersion.
zh_cn: 这和旧的 @TargetApi 注解的目的相似，但更清晰地表示这是对调用者的要求，而不是在超过 minSdkVersion 的方法内使用 "suppress" 警告。

source: This is similar to the on... events in Activity or ListActivity that you override for lifecycle and other functionality hooks.
zh_cn: 这和在 Activity 或 ListActivity 中的 on... 事件一样，你可以重写生命周期或其他一些有用 hook。

source: This is subtly different from the policy of ignoring views that are marked as GONE outright.
zh_cn: 这与忽略标记为 GONE 的 view 的政策略有不同。

source: This is the default, so nothing needs to be done.
zh_cn: 这是默认设置，因此无需执行任何操作。

source: This is the default.
zh_cn: 这是默认值。

source: This is the persistent state that is saved by ViewPager.
zh_cn: 这是 ViewPager 保存的持久状态。

source: This is the position from the Adapter's perspective.
zh_cn: 这是 Adapter 视角的 position。

source: This is the position from the LayoutManager's perspective.
zh_cn: 这是 LayoutManager 视角的 position。

source: This is the recommended default for most applications and usages.
zh_cn: 这是大多数应用程序和用法的推荐默认值。

source: This is the same as saying (color >> 16) & 0xFF
zh_cn: 这与 (color >> 16) & 0xFF 相同

source: This is the same as saying (color >> 8) & 0xFF
zh_cn: 这与 (color >> 8) & 0xFF 相同

source: This is the same as saying color & 0xFF
zh_cn: 这与 color & 0xFF 相同

source: This is the same as saying color >>> 24
zh_cn: 这与 color >>> 24相同

source: This is typically used on methods and classes that are accessed only via reflection so a compiler may think that the code is unused.
zh_cn: 这通常用于仅通过反射访问的方法和类，因此编译器可能认为代码未使用。

source: This is used for accessibility and tooltips.
zh_cn: 这用于辅助功能和工具提示。

source: This is used to fill in AccessibilityNodeInfo#setClassName.
zh_cn: 这用于填写 AccessibilityNodeInfo#setClassName。

source: This is useful (in conjunction with the FLAG_FULLSCREEN and FLAG_LAYOUT_IN_SCREEN window flags) for displaying content using every last pixel on the display.
zh_cn: 这很有用(与 FLAG_FULLSCREEN 和 FLAG_LAYOUT_IN_SCREEN 窗口标志一起使用)，用于使每一个像素都用来显示内容。

source: This is useful because it controls access to them but isn't necessary (perhaps you want to create a new public View for wider use in your application).
zh_cn: 定义为内部类是有用的但不是必须的。有用是因为它可以控制对它的访问，不是必须是因为你可能想要创建一个公用的类来在应用中广泛使用。

source: This is useful if there's an intermediary that wants to first decode the bounds and then decode the image.
zh_cn: 如果有一个中介希望先解码边界然后对图像进行解码，那么这非常有用。

source: This is useful when implementing a collapsing as it allows the Toolbar to be fixed in place even though this layout is moving.
zh_cn: 这在实现折叠时非常有用，因为它允许将 Toolbar 固定到位，即使此布局正在移动。

source: This is useful when used in a ListView where the setChoiceMode has been set to something other than CHOICE_MODE_NONE.
zh_cn: 当在 ListView 中使用时，这很有用，其中 setChoiceMode 已设置为 CHOICE_MODE_NONE。

source: This is useful when you want to add auto-save functionality as changes are made, or validate the format of user input, for example.
zh_cn: 例如，当你想要在进行更改时添加自动保存功能或验证用户输入的格式时，这非常有用。

source: This is usually used for methods that have no side effect, so calling it without actually looking at the result usually means the developer has misunderstood what the method does.
zh_cn: 这通常用于没有副作用的方法，所以在没有实际查看结果的情况下调用它通常意味着开发人员误解了该方法的作用。

source: This is very ugly but the only place we can grab this information before the View is rebound and returned to the LayoutManager for post layout ops.
zh_cn: 这很难看，但在 view 重新绑定并返回到 LayoutManager 进行后期布局操作之前，我们只能在这里获取这些信息。

source: This is very useful to efficiently store masks for instance.
zh_cn: 这对于有效存储 masks （遮罩）非常有用。

source: This is why the "normal" button image comes last, because it will only be applied after android:state_pressed and android:state_focused have both evaluated false.
zh_cn: 这就是为什么“normal”按钮图像最后出现的原因，因为它只会在 android:state_pressed 和 android:state_focused 都被计算为 false 之后应用。

source: This item has two TextViews elements (or subclasses) with the ID values text1 and text2.
zh_cn: 此项目有两个 TextViews 元素(或子类)，ID 值 text1 和 text2。

source: This key difference allows a TextureView to be moved, transformed, animated, etc.
zh_cn: 这个关键区别允许 TextureView 移动，转换，动画。

source: This launch mode can also be used to good effect in conjunction with FLAG_ACTIVITY_NEW_TASK: if used to start the root activity of a task, it will bring any currently running instance of that task to the foreground, and then clear it to its root state.
zh_cn: 此启动模式还可以与 FLAG_ACTIVITY_NEW_TASK 一起使用，以获得良好的效果：如果用于启动任务的根 activity，则会将该任务的任何当前运行实例置于前台，然后将其清除到根状态。

source: This layout currently only supports child views of type MaterialButton.
zh_cn: 此布局当前仅支持 MaterialButton 类型的子 view。

source: This layout should be made the parent of the view that will be refreshed as a result of the gesture and can only support one direct child.
zh_cn: 此布局应作为将作为手势的结果进行刷新的 view 的父级，并且只能支持一个直接子级。

source: This layout will be automatically populated from the PagerAdapter's page titles.
zh_cn: 此布局将从 PagerAdapter 的页面标题中自动填充。

source: This lesson covers some of the most common operations.
zh_cn: 本课程介绍了一些最常见的操作。

source: This lesson demonstrates how to use features of the Android framework to add these real-world behaviors to your custom view.
zh_cn: 本课程演示如何使用 Android 框架的功能将这些真实行为添加到自定义view中。

source: This lesson discusses how to use the Android framework to create the core functionality of a view class.
zh_cn: 本类讨论如何使用 Android 框架创建视图类的核心函数式。

source: This lets applications get a reference to the inflated View without executing an extra findViewById().
zh_cn: 这使应用程序可以获得对加载的 View 的引用，而无需执行额外的 findViewById()。

source: This lets other visual state of the view update before click actions start.
zh_cn: 这允许在点击操作开始之前更新 view 的其他可视状态。

source: This level is always logged.
zh_cn: 系统一直会记录此级别的日志。

source: This level of access is fundamentally insecure.
zh_cn: 这种访问级别基本上是不安全的。

source: This level will be logged, even on release builds, and is required to be surrounded by an if (LOCAL_LOG) or if (LOCAL_LOGD) block, where LOCAL_LOG[D] is defined in your class or subcomponent, so that there can exist a possibility to disable all such logging.
zh_cn: 系统会记录此级别的日志（即使在发布版本中），并且周围要有 if (LOCAL_LOG) 或 if (LOCAL_LOGD) 块，其中 LOCAL_LOG[D] 在你的类或子组件中定义。这样一来，系统有可能停用所有此类日志记录。

source: This level will only be logged on debug builds and should be surrounded by an if (LOCAL_LOGV) block (or equivalent) so it can be compiled out by default.
zh_cn: 系统仅针对调试版本记录此级别的日志，并且周围要有 if (LOCAL_LOGV) 块（或同类块），以便能够默认编译。

source: This listener will be called whenever the user clicks the navigation button at the start of the toolbar.
zh_cn: 只要用户单击工具栏开头的导航按钮，就会调用此监听器。

source: This listener will be invoked whenever a user selects a menu item from the action buttons presented at the end of the toolbar or the associated overflow.
zh_cn: 只要用户从工具栏末尾显示的操作按钮或相关溢出中选择菜单项，就会调用此监听器。

source: This may be used by the system to prioritize operations such as fragment lifecycle updates or loader ordering behavior.
zh_cn: 系统可以使用这一点来优先处理诸如片段生命周期更新或加载器排序行为的操作。

source: This may change the aspect ratio of the src.
zh_cn: 这可能会改变 src 的宽高比。

source: This may not reflect a pending show operation in progress.
zh_cn: 这可能不反映正在进行的挂起的显示操作。

source: This means SlidingDrawer should only be used inside of a FrameLayout or a RelativeLayout for instance.
zh_cn: 这意味着 SlidingDrawer 只能在 FrameLayout 或 RelativeLayout 中使用。

source: This means that the insets seen there will always represent the worst case that the application can expect as a continuous state.
zh_cn: 这意味着在那里看到的 insets 总是代表应用程序可以期望作为连续状态的最坏情况。

source: This means that translating and scaling a SurfaceView on screen will not cause rendering artifacts.
zh_cn: 这意味着在屏幕上平移和缩放 SurfaceView 不会导致渲染工件。

source: This means your onClick code must execute quickly to avoid delaying your app's response to further user actions.
zh_cn: 这意味着你的 onClick 代码必须快速执行，以避免延迟应用程序对进一步用户操作的响应。

source: This method calls #onCreateViewHolder(ViewGroup, int) to create a new ViewHolder and initializes some private fields to be used by RecyclerView.
zh_cn: 此方法调用 #onCreateViewHolder(ViewGroup, int) 创建新的 ViewHolder 并初始化一些要由 RecyclerView 使用的私有字段。

source: This method internally calls #onBindViewHolder(ViewHolder, int) to update the ViewHolder contents with the item at the given position and also sets up some private fields to be used by RecyclerView.
zh_cn: 此方法在内部调用 #onBindViewHolder(ViewHolder, int) 以使用给定位置的项更新 ViewHolder 内容，并设置一些私有字段供 RecyclerView 使用。

source: This method is called whenever a dependent view changes in size or position outside of the standard layout flow.
zh_cn: 只要从属 view 的大小或位置在标准布局流程之外发生变化，就会调用此方法。

source: This method is deprecated in favor of getMeasureAllChildren(), which was renamed for consistency with setMeasureAllChildren().
zh_cn: 不推荐使用此方法，而选择 getMeasureAllChildren()，为了与 setMeasureAllChildren() 保持一致而重命名。

source: This method is deprecated.
zh_cn: 这个方法已被弃用。

source: This method is invoked automatically on objects managed by the try-with-resources statement.
zh_cn: 在 try-with-resources 语句管理的对象上自动调用此方法。

source: This method is invoked by measure(int, int) and should be overridden by subclasses to provide accurate and efficient measurement of their contents.
zh_cn: 该方法通过 measure(int, int) 执行，并且子类应该重写以提供其内容的正确而有效的测量结果。

source: This method is required for a PagerAdapter to function properly.
zh_cn: 此方法是 PagerAdapter 正常运行所必需的。

source: This method is safe to call from any thread.
zh_cn: 从任何线程调用都可以安全地使用此方法。

source: This method is typically called by a view on itself when it believes that is can no longer fit within its current bounds.
zh_cn: 该方法典型的调用，是当一个 view 相信自己不再适合当前的边界时，对自己调用。

source: This method may be overridden by ViewParent implementations to indicate when the view is willing to support a nested scrolling operation that is about to begin.
zh_cn: ViewParent 实现可以重写此方法，以指示 view 何时愿意支持即将开始的嵌套滚动操作。

source: This method may take several seconds to complete, so it should only be called from a worker thread.
zh_cn: 此方法可能需要几秒钟才能完成，因此只能从工作线程调用它。

source: This method passes back a TypedArray array of values that have already been dereferenced and styled.
zh_cn: 此方法传回已取消引用和样式化的 TypedArray 值数组。

source: This method should not create a new View.
zh_cn: 此方法 不 应创建新 view。

source: This method should return a new set of layout params suitable for this ViewGroup, possibly by copying the appropriate attributes from the specified set of layout params.
zh_cn: 此方法应返回适合此 ViewGroup 的一组新布局参数，可能是通过从指定的布局参数集复制适当的属性。

source: This method should update the contents of the ViewHolder#itemView to reflect the item at the given position.
zh_cn: 此方法应更新 ViewHolder#itemView 的内容，以反映给定位置的项。
